cask_args appdir: "/Applications"

tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jondot/tap"
tap "koekeishiya/formulae"
tap "romkatv/powerlevel10k"
tap "smudge/smudge"
tap "stripe/stripe-cli"


# 
# Brew
# 
# Extendable version manager with support for Ruby, Node.js, Erlang & more https://asdf-vm.com/
brew "asdf"

# Official Amazon AWS command-line interface https://aws.amazon.com/cli/
brew "awscli"

# Cat(1) clone with syntax highlighting and Git integration. https://github.com/sharkdp/bat
brew "bat"

# Dependency manager for Cocoa projects https://cocoapods.org/
brew "cocoapods"

# asdf golang dependencies | GNU File, Shell, and Text utilities https://www.gnu.org/software/coreutils
brew "coreutils"

# Utility for managing cargo dependencies from the command-line https://killercup.github.io/cargo-edit/
brew "cargo-edit"

# Select default apps for documents and URL schemes on macOS https://github.com/moretension/duti/
brew "duti"

# Official Go implementation of the Ethereum protocol https://geth.ethereum.org/
brew "ethereum"

# Modern replacement for ls. https://github.com/ogham/exa
brew "exa"

# Play, record, convert, and stream audio and video https://ffmpeg.org/
brew "ffmpeg"

# Command-line fuzzy finder written in Go https://github.com/junegunn/fzf
brew "fzf"

# Command-line JSON processing tool https://github.com/antonmedv/fx
brew "fx"

# asdf nodejs dependencies | GNU awk utility https://www.gnu.org/software/gawk/
brew "gawk"

# GitHub command-line tool. https://github.com/cli/cli
brew "gh"

# Distributed revision control system. https://git-scm.com
brew "git"

# asdf nodejs dependencies | GNU Pretty Good Privacy (PGP) package https://gnupg.org/
brew "gpg"

# GNU grep, egrep and fgrep https://www.gnu.org/software/grep/
brew "grep"

# Kubernetes package manager https://helm.sh/
brew "helm"

# Heroku Command Line Interface https://devcenter.heroku.com/articles/heroku-cli
brew "heroku"
brew "heroku-node"

# Lightweight and flexible command-line JSON processor https://stedolan.github.io/jq/
brew "jq"

# The scalable code generator that saves you time. https://www.hygen.io/
brew "hygen"

# Ambitious Vim-fork focused on extensibility and agility https://neovim.io/
brew "neovim"

# Simple command line interface for the Mac App Store. https://github.com/mas-cli/mas
brew "mas"

# Run a Kubernetes cluster locally https://minikube.sigs.k8s.io/
brew "minikube"

# mono is currently not working for M1 Mac
# https://gurutaka-log.com/unity-vscode-mac-setup
# 
# Cross platform, open source .NET development framework. https://www.mono-project.com/
brew "mono"

# A CLI for configuring 'Night Shift' on macOS https://github.com/smudge/nightlight
brew "nightlight"

# Generate clients, server & docs from an OpenAPI spec https://openapi-generator.tech/
brew "openapi-generator"

# Object-relational database system https://www.postgresql.org/
brew "postgresql"

# A Zsh Theme https://github.com/romkatv/powerlevel10k
brew "powerlevel10k"

# Persistent key-value database, with built-in net interface https://redis.io/
brew "redis"

# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"

# Simple hotkey-daemon for macOS. https://github.com/koekeishiya/skhd
brew "skhd"

# Organize software neatly under a single directory tree https://www.gnu.org/software/stow/
brew "stow"

# Build, test, and manage your Stripe integration https://stripe.com/docs/stripe-cli
brew "stripe"

# Programmatically correct mistyped console commands https://github.com/nvbn/thefuck
brew "thefuck"

# Text interface for Git repositories https://jonas.github.io/tig/
brew 'tig'

# Terminal multiplexer https://tmux.github.io/
brew "tmux"

# Display directories as trees http://mama.indstate.edu/users/ice/tree/
brew 'tree'

# Executes a program periodically, showing output fullscreen https://gitlab.com/procps-ng/procps
brew "watch"

# A tiling window manager for macOS based on binary space partitioning. https://github.com/koekeishiya/yabai
brew "yabai"


# 
# Cask
# 
# Password manager that keeps all passwords secure behind one password. https://1password.com
cask "1Password"

# Application launcher and productivity software. https://www.alfredapp.com
cask "alfred"

# Tools for building Android applications https://developer.android.com/studio
cask "android-studio"

# FreeMacSoft AppCleaner https://freemacsoft.net/appcleaner/
cask "appcleaner"

# Tool to customize input devices and automate computer systems https://folivora.ai/
# cask "bettertouchtool"

# Virtual Audio Driver https://existential.audio/blackhole/
cask "blackhole-2ch"

# Free and open-source 3D creation suite. https://www.blender.org
cask "blender"

# Lock/unlock Apple computers using the proximity of a bluetooth low energy device https://github.com/ts1/BLEUnlock
cask "bleunlock"

# Screen Saver by Pedro Carrasco. https://github.com/pedrommcarrasco/Brooklyn
cask "brooklyn"

# Automated testing of webapps for Google Chrome https://sites.google.com/chromium.org/driver/
cask "chromedriver"

# Color picking application. https://colorsnapper.com
cask "colorsnapper"

# Trains AIs to understand and translate texts. https://www.deepl.com
cask "deepl"

# Voice and text chat software. https://discord.com
cask "discord"

# App to build and share containerized applications and microservices https://www.docker.com/products/docker-desktop
cask "docker"

# .NET is a free, cross-platform, open source developer platform https://dotnet.microsoft.com/
cask "dotnet-sdk"

# Tool for using an iPad as a second display https://www.duetdisplay.com/
cask "duet"

# Reimagine your terminal https://fig.io/
cask "fig"

# Collaborative interface design tool. https://www.figma.com
cask "figma"

# Mozilla Firefox Developer Edition. https://www.mozilla.org/firefox/developer
cask "firefox-developer-edition"

# UI toolkit for building applications for mobile, web and desktop https://flutter.dev/
cask "flutter"

# font-meslo-lg-nerd-font https://github.com/ryanoasis/nerd-fonts
cask "font-meslo-lg-nerd-font"

# GIT client　https://fork.dev/
cask "fork"

# Personal blockchain for Ethereum development https://truffleframework.com/ganache/
cask "ganache"

# Git client focusing on productivity https://www.gitkraken.com/ 
# cask "gitkraken"

# Web browser. https://www.google.com/chrome
cask "google-chrome"

# Google Cloud SDK https://cloud.google.com/sdk/
cask "google-cloud-sdk"

# Client for the Google Drive storage service https://www.google.com/drive/
cask "google-drive"

# Google Japanese Input Method Editor. https://www.google.co.jp/ime
cask "google-japanese-ime"

# Screenshot and screen recording tool https://gyazo.com/
cask "gyazo"

# Automated organization https://www.noodlesoft.com/
cask "hazel"

# Terminal emulator as alternative to Apple's Terminal app. https://www.iterm2.com
cask "iterm2"

# Keyboard customizer. https://pqrs.org/osx/karabiner
cask "karabiner-elements"

# Automation software https://www.keyboardmaestro.com/main/
cask "keyboard-maestro"

# Interface for reading and syncing eBooks. https://www.amazon.com/gp/digital/fiona/kcp-landing-page
cask "kindle"

# Preview and audit Kindle eBooks https://www.amazon.com/Kindle-Previewer/b?ie=UTF8&node=21381691011
cask "kindle-previewer"

# Wallet desktop application to maintain multiple cryptocurrencies https://www.ledgerwallet.com/live
cask "ledger-live"

# Reverse proxy, secure introspectable tunnels to localhost https://ngrok.com/
cask "ngrok"

# App to write, plan, collaborate, and get organized. https://www.notion.so
cask "notion"

# Collaboration platform for API development. https://www.postman.com
cask "postman"

# Jetbrains PyCharm Community Edition https://www.jetbrains.com/pycharm/
cask "pycharm-ce"

# Team communication and collaboration software. https://slack.com
cask "slack"

# Music streaming service. https://www.spotify.com
cask "spotify"

# Reformatting Swift code. https://github.com/nicklockwood/SwiftFormat
cask "swiftformat-for-xcode"

# Native GUI tool for relational databases https://tableplus.com/
cask "tableplus"

# Management tool for Unity. https://unity3d.com/get-unity/download
cask "unity-hub"

# Open-source code editor. https://code.visualstudio.com
cask "visual-studio-code"

# Multimedia player. https://www.videolan.org/vlc
cask "vlc"

# Video communication and virtual meeting platform https://www.zoom.us/
cask "zoom"

# NOT WORKING ON M1 MAC
# hosted hypervisor for x86 virtualization https://www.virtualbox.org/
cask "virtualbox" if system '[ "$(uname -m)" = "x86_64" ]'

# Oracle VirtualBox Extension Pack https://www.virtualbox.org/
cask "virtualbox-extension-pack" if system '[ "$(uname -m)" = "x86_64" ]'

# Graphical network analyzer and capture tool https://www.wireshark.org
cask "wireshark" if system '[ "$(uname -m)" = "x86_64" ]'


# 
# mas
# 
if OS.mac?
# Apple's integrated development environment for macOS. https://developer.apple.com/xcode/
mas "Xcode", id: 497799835

# The cat tells you the CPU usage of Mac by running speed. https://kyome.io/runcat/
# mas "RunCat", id: 1429033973
end
