{"id":116301,"xmlId":"PerforceIC","name":"Perforce IDEA Community Integration","description":"\n      <p>\n      <a href=\"https://github.com/groboclown/p4ic4idea\">[ Github ]</a> | <a href=\"https://github.com/groboclown/p4ic4idea/issues?q=is%3Aopen+is%3Aissue+-label%3A0.9\">[ Open Issues ]</a>\n      </p>\n      <p>\n      Associate your IDEA project with Perforce (\"p4\") through the built-in version control.\n      </p>\n      <p>\n      Limitations:\n      </p>\n      <ul>\n        <li>Does not indicate to the user whether a file is\n        synchronized to the head revision or not, or if the file is locked in Perforce.</li>\n        <li>No resolving merge conflicts.</li>\n        <li>Symlinks not properly supported.</li>\n      </ul>\n      <p>\n      The plugin will keep your client's open changelists\n      synchronized with the IDEA backed changelists, viewable\n      under the \"Changes\" view.  If the changelists become\n      out of sync, you can force the plugin to re-examine the\n      mappings by pressing the refresh button in the changes view.\n      </p>\n      <p>\n      Modifying a file, moving a file, copying a file, refactoring\n      a file, and deleting a file will perform the correct Perforce\n      operations, and put the changes into the currently selected\n      IDEA changelist.  Per-file history allows for comparing\n      against the depot versions, even against the inherited file\n      history.\n      </p>\n      <p><strong>Getting Started</strong></p>\n      <p>\n      Once you install the plugin, you can associate a project directory\n      with Perforce in the project settings (<b>File</b> - <b>Settings...</b>,\n      then navigate to the <b>Version Control</b> panel).\n      Click on the \"edit\" icon for the version control root directories to setup\n      the server connection.\n      </p>\n      <p>\n      For most people, the environment variables will be sufficient to use the\n      same mechanism to connect to the Perforce server as what the\n      command-line <code>p4</code> tool does.  However, you may need to\n      explicitly set the property values, or use a file that contains the\n      settings.\n      </p>\n      <p>\n      For SSL, you will want to use a <code>P4PORT</code> setting that starts\n      with <code>ssl://</code> (such as <code>ssl://perforce:1666</code>).  If\n      you have the server registered in the authorized hosts, then make sure\n      that `P4TRUST` setting points to that file; or you can add a SSL server\n      fingerprint setting to explicitly state the expected SSL fingerprint.\n      </p>\n      <p>\n      Full documentation on the configuration settings is on the\n      <a href=\"https://github.com/groboclown/p4ic4idea\">main project page</a>.\n      </p>\n      <p>\n      Please visit the GitHub project\n      <a href=\"https://github.com/groboclown/p4ic4idea/issues?q=is%3Aopen+is%3Aissue+-label%3A0.9\">open issues</a>\n      for a list of known issues, or for reporting new ones.\n      </p>\n    ","tags":["VCS integration"],"vendor":"Groboclown","version":"0.11.3","notes":"\n    <ul>\n      <li><em>0.11.3</em><ul>\n        <li>Fixed a bug where a list returned by the IDE API was assumed to be mutable.</li>\n      </ul></li>\n      <li><em>0.11.2</em><ul>\n        <li>Fixed compatiblity check to handle JetBrains 2020.2.1 and Android Studio 4.0.</li>\n      </ul></li>\n    </ul>\n    ","dependencies":["com.intellij.modules.vcs"],"since":"171.0","sourceCodeUrl":"https://github.com/groboclown/p4ic4idea","size":7618683}