{"id":142519,"xmlId":"com.codestream.jetbrains-codestream","name":"New Relic CodeStream: GitHub, GitLab, PRs and Code Review","description":"<p><b>CodeStream is now part of New Relic. <a href=\"https://newrelic.com/blog/nerdlog/announcing-new-relic-codestream\">Learn more.</a></b></p>\n\n<p>New Relic CodeStream is a developer collaboration platform that integrates all of your essential dev tools into your IDE. Eliminate context-switching and simplify code discussion and code review by putting collaboration tools in your IDE.</p>\n<br>\n<p><img src=\"https://raw.githubusercontent.com/TeamCodeStream/codestream-guide/develop/docs/src/assets/images/CSforJB3.png\" alt=\"CodeStream for JetBrains\"></p>\n\n<h1>Integrations</h1>\n<ul>\n    <li><b>Code Hosts:</b> Bitbucket, Bitbucket Server, GitHub, GitHub Enterprise, GitLab, GitLab Self-Managed</li>\n    <li><b>Issue Trackers:</b> Asana, Azure DevOps, Bitbucket, Clubhouse, GitHub, GitHub Enterprise, GitLab, GitLab Self-Managed, Jira, Linear, Trello, YouTrack</li>\n    <li><b>Observability:</b> New Relic One, Microsoft Pixie</li>\n    <li><b>Messaging Services:</b> Slack, Microsoft Teams</li>\n</ul>\n\n<h1>Requirements</h1>\n<ul>\n    <li>CodeStream requires version 2020.3.1 or later of any JetBrains IDE, and is also available for <a href=\"https://marketplace.visualstudio.com/items?itemName=CodeStream.codestream\">VS Code</a> or <a href=\"https://marketplace.visualstudio.com/items?itemName=CodeStream.codestream-vs\">Visual Studio</a>.</li>\n    <li>Your repository must be managed by Git, or a Git hosting service like GitHub.</li>\n</ul>\n\n<h1>Create and Review GitHub and GitLab Pull Requests in your IDE</h1>\n<p>Create, review and merge GitHub pull requests and GitLab merge requests inside your IDE, with full source-tree and full file access, your favorite keybindings, built-in diff tool, and code intelligence.</p>\n<br>\n<p><img src=\"https://raw.githubusercontent.com/TeamCodeStream/codestream-guide/develop/docs/src/assets/images/animated/PullRequest-JB.gif\" alt=\"Pull Request\"></p>\n\n<h1>Get Feedback on Work-in-Progress with Pre-PR Code Reviews</h1>\n<p>CodeStream's lightweight feedback requests let you get feedback on your changes regardless of the current state of your repo, without the friction of committing, pushing or issuing a pull request. Your teammates can review your changes right in their IDE, with full file context, and with no need to set aside their current work to switch branches or pull the latest.</p>\n<br>\n<p><img src=\"https://raw.githubusercontent.com/TeamCodeStream/codestream-guide/develop/docs/src/assets/images/animated/FRPerform-JB.gif\" alt=\"Review Changes\"></p>\n<br>\n<p>CodeStream’s feedback requests are so easy that you can start doing them throughout the development process instead of waiting until the end. You’re a few days into a sprint and have some work stubbed out? Maybe some work that hasn’t even been committed. Get feedback on your work-in-progress so that you can identify and resolve issues early instead of saving those gotchas for when you need to get the code merged.</p>\n\n<h1>Simplified Code Discussion</h1>\n<p>Rather than copying &amp; pasting, CodeStream enables in-editor commenting on any code in your repository, with optional sharing to Slack, MS Teams or via email, with automatic at-mentioning of code authors via git blame.</p>\n<br>\n<p><img src=\"https://raw.githubusercontent.com/TeamCodeStream/codestream-guide/develop/docs/src/assets/images/animated/DiscussCode1-JB.gif\" alt=\"Discuss Code\"></p>\n<br>\n<p>Your teammates can participate in the discussion right from their IDE, or from Slack, Teams, or replying to the email.</p>\n<br>\n<p><img src=\"https://raw.githubusercontent.com/TeamCodeStream/CodeStream/master/images/ShareOnSlack1.png\" alt=\"Share on Slack\"></p>\n\n<h1>Add Observability to your IDE</h1>\n<p>Resolve production errors faster and improve software performance by bringing production telemetry from New Relic One into your IDE. Operations and dev teams can identify application owners quickly and work together to resolve critical errors.</p>\n<br>\n<p><img src=\"https://raw.githubusercontent.com/TeamCodeStream/codestream/develop/images/animated/Observability-JB.gif\" alt=\"Observability\"></p>\n<br>\n<p>In a single click, you can jump from Errors Inbox in New Relic One to their IDE and step through the stack trace for code-level debugging of high-impact errors. Additionally, discover, view, filter, and update the status of open issues all from the comfort of your favorite IDE.</p>\n\n<h1>Build the Knowledge Base Behind Your Codebase</h1>\n<p>CodeStream turns conversation into documentation by capturing all of the discussion about your code, and saving it with your code. Comment and code review threads are automatically repositioned as your code changes, even across branches. All with zero effort on your part.</p>\n<br>\n<p><img src=\"https://raw.githubusercontent.com/TeamCodeStream/codestream-guide/develop/docs/src/assets/images/animated/KnowledgeBase1-JB.gif\" alt=\"Knowledge Base\"></p>\n<br>\n<p>Previously discussed questions and issues that explain important decisions are now accessible right where you need them, when you need them. Just click on the codemark to expand it and see how something works or why something was done a certain way.</p>\n\n<h1>Frequently Asked Questions</h1>\n\n<h4>Where are messages stored?</h4>\n<p>Your team’s codemarks, which include the message text and the code snippet, are stored in the cloud on CodeStream’s servers. CodeStream uses best practices when it comes to <a href=\"https://www.codestream.com/security\">security</a>.\n\n</p><h1>Help &amp; Feedback</h1>\n<p>Check out the <a href=\"https://docs.codestream.com/userguide/\">user guide</a> for more information on getting started with CodeStream. Please follow <a href=\"http://twitter.com/teamcodestream\">@teamcodestream</a> for product updates and to share feedback and questions. You can also email us at support@codestream.com.</p>\n<p>\n    <br>\n    <a title=\"Learn more about CodeStream\" href=\"https://codestream.com?utm_source=jbmarket&amp;utm_medium=banner&amp;utm_campaign=codestream\"><img src=\"https://alt-images.codestream.com/codestream_logo_jbmarketplace.png\" alt=\"CodeStream Logo\"></a>\n</p>","tags":["Code tools","Tools integration","TeamWork","Issue Trackers Integration","Issue View","Workflow","Comments","Code Quality","GitHub","Productivity"],"vendor":"CodeStream","version":"12.0.2+203","notes":"<h4>12.0.2</h4>\n<h5>Added</h5>\n<ul>\n    <li>Fixes an issue that prevented you from signing up with a webmail address</li>\n    <li>Fixes an issue that allowed you to share a pending error to Slack/MS Teams</li>\n</ul>\n<h4>12.0.0</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds an <a href=\"https://youtrack.jetbrains.com/issue/IDEA-273222\">integration with New Relic One</a> that allows you to discover, investigate and collaborate on errors from your IDE, as well as dynamic logging in production using Pixie and the ability to instrument your projects right from your IDE</li>\n</ul>\n<h4>11.1.1</h4>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes an issue where some users couldn't switch to certain organizations</li>\n</ul>\n<h4>11.1.0</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds support for allowing people to join your CodeStream organization when signing up with specific email domains</li>\n    <li>Adds the ability to filter the Activity Feed to just discussions about repos open in your IDE, or even specific folders (i.e. monorepo scenarios)</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>Eliminates the concept of a team on CodeStream, with everyone from a company now being in a single CodeStream organization</li>\n    <li>Replaces the My Team section of the sidebar with a My Organization menu at the top of the CodeStream pane</li>\n    <li>Eliminates invitation codes, with teammates now accepting invitations simply by signing up with the email address the invitation was sent to</li>\n</ul>\n<h4>11.0.16</h4>\n<h5>Fixed</h5>\n<ul>\n    <li>Workaround for <a href=\"https://youtrack.jetbrains.com/issue/IDEA-273222\">issue with JCEF on Linux</a> that forces use of JxBrowser instead</li>\n    <li>Fixes an issue with CodeStream overriding GitLab defaults for \"Squash commits\" and \"Delete source branch\"</li>\n</ul>\n<h4>11.0.14</h4>\n<h5>Fixed</h5>\n<ul>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/702\">#702</a> - Text is duplicated when I do \"Paste\"\n    </li><li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/701\">#701</a> - Failed to load MR list from Gitlab.com\n    </li><li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/681\">#681</a> - Emojis don't load in jb PR names\n    </li><li>Fixes an issue with returning users not being able to accept updated TOS</li>\n</ul>\n<h4>11.0.13</h4>\n<h5>Changed</h5>\n<ul>\n    <li>Custom merge request queries now use proper GitLab syntax</li>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/677\">#677</a> - Merge Request Query for negate\n    </li><li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/661\">#661</a> - MR integration doesn't work with project token\n    </li><li>No-reply email addresses, such as @users.noreply.github.com, are no longer suggested throughout CodeStream</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/657\">#657</a> - Plugin window is always Loading... in Intellij IDEA\n    </li><li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/690\">#690</a> - CodeStream plugins fails to load in Android Studio Arctic Fox 2020.1.3\n    </li><li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/674\">#674</a> - CodeStream is always loading，Restboot Android Studio is not available\n    </li><li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/693\">#693</a> - Changing PR remote branch makes the branch unable to be found\n    </li><li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/673\">#673</a> - Request codestream/reviews/create failed with message: Cannot create review. Payload exceeds 10MB\n    </li><li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/650\">#650</a> - Code fences displayed as single line in Issue Codemarks\n</li></ul>\n<h4>11.0.12</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds the ability to <a href=\"https://guide.codestream.us/userguide/faq/custom-queries-gl/\">filter GitLab custom issue queries</a> by project and group</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/596\">#596</a> - Error with renamed file in a PR review\n    </li><li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/490\">#490</a> - Starting work on issue and creating branch does not update UI\n    </li><li>Fixes an issue where commenting outside of the changeset, but very close to it, in a PR results in an error</li>\n</ul>\n<h4>11.0.11</h4>\n<h5>Changed</h5>\n<ul>\n    <li>Brings back support for JXBrowser and Android Studio (v4.2 or later)</li>\n    <li>Auto-prompt for feedback requests can be turned off via toggle above the form even when committing from within the IDE</li>\n    <li>Changes to a pull requests's title and labels are immediately reflected in the Pull/Merge Request section after saving the changes</li>\n    <li>Fall back to using first intial for a headshot when headshots in pull requests aren't accessible</li>\n    <li>Clicking on images in pull requests now open the full-size image on the web</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes a \"Cannot read property 'full' of undefined\" error in the Merge Requests section</li>\n    <li>Fixes an issue with double quotes needing to be escaped when creating a custom PR filter for GitHub</li>\n    <li>Fixes an issue where you can't start a PR review when the commit selection is anything other than \"Changes from all commits\"</li>\n    <li>Fixes a \"Registry key not defined error\" with IntelliJ EAP</li>\n</ul>\n<h4>11.0.10</h4>\n<h5>Changed</h5>\n<ul>\n    <li>Adds the ability to create a custom filer in the Issues section for GitLab</li>\n    <li>Adds confirmation when user cancels a pending pull/merge request review</li>\n    <li>Live View is now free for all teams</li>\n    <li>Adds copy to the Issues section when there are no results to display</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes an issue with emoji not rendering in labels for pull requests</li>\n</ul>\n<h4>11.0.9</h4>\n<h5>Changed</h5>\n<ul>\n    <li>Updated terms-of-service acceptance flow</li>\n    <li>Removed support for JXBrowser</li>\n</ul>\n<h4>11.0.8</h4>\n<h5>Changed</h5>\n<ul>\n    <li>You can now reply to any top-level comment in a merge request, regardless of whether or not it was started as a thread</li>\n    <li>Form that automatically pops up to request feedback when you commit is now dismissed after 15 minutes of inactivity</li>\n    <li>Changing branches while you have the feedback request form open no longer updates the form</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/595\">#595</a> - Connectivity Issues Makes CodeStream Unusable\n    </li><li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/590\">#590</a> - Commit selection is reset for a Gitlab MR after posting a comment\n    </li><li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/522\">#522</a> - Support multi-line comments in GL MR\n    </li><li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/400\">#400</a> - Agent is detected as a new process by Intego NetBarrier every time IntelliJ starts\n    </li><li>Fixes an issue with quote replies in a merge request where the reply text would get included in the quote</li>\n    <li>Fixes an unhandled exception when tail of file is collapsed</li>\n    <li>Fixes an issue where resolving a codemark or feedback request marks it as unread in the Codemarks/Feedback Requests section of the CodeStream pane</li>\n    <li>Fixes an issue with the Commits tab in a pull/merge request showing commits in the wrong order</li>\n</ul>\n<h4>11.0.7</h4>\n<h5>Changed</h5>\n<ul>\n    <li>Updated the UI for custom filters in the Issues section to be consistent with custom queries in the PRs section</li>\n    <li>Prevent diffs in feedback requests and pull requests from being displayed in Unified View since it isn't supported</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/547\">#547</a> - Reviewing Gitlab MR with a partial commit range shows invalid changesets\n    </li><li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/541\">#541</a> - Suppress html comments in rendering of issues\n    </li><li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/537\">#537</a> - Branch selection in dropdown of Codemarks section should automatically pick up branch change\n    </li><li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/522\">#546</a> - Support multi-line comments in GL MR\n</li></ul>\n<h4>11.0.6</h4>\n<h5>Added</h5>\n<ul>\n    <li>The Pull/Merge Requests section of the CodeStream pane now refreshes every 5 minutes to pick up changes</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/506\">#506</a> - Don't reset scroll position when switching tabs in a PR\n    </li><li>Custom queries for either GitHub PRs or GitHub issues now requires [at least one qualifier](https://docs.codestream.com/userguide/faq/custom-queries/) that will prevent the query from return results across all of GitHub</li>\n    <li>The banner indicating connectivity issues has been replaced with the blanket that covers the entire CodeStream pane</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/546\">#546</a> - Cannot open GitHub Enterprise 2.22 PRs\n    </li><li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/565\">#565</a> - Toast notifications (and log) replace \"this\" with feedback request name\n    </li><li>Fixes an issue where creating an additional CodeStream team would result in an endless spinner</li>\n    <li>Fixes an IndexOutOfBoundsException exception</li>\n    <li>Fixes an issue where an @mention in a codemark shared to Slack would register twice in the count in the badge on the Activty Feed</li>\n    <li>Fixes an issue where adding an emoji to a merge request comment would sometimes add it at the start of the comment regardless of the cursor position</li>\n</ul>\n<h4>11.0.5</h4>\n<h5>Added</h5>\n<ul>\n    <li>Provide feedback in the UI for on-prem customers when the api server can't communicate with the broadcaster</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>Repo/branch names at the top of GitHub pull requests are now links to the appropriate branch on GitHub</li>\n    <li>Automatically restart the agent process if it crashes</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/535\">#535</a> - Invalid regular expression error\n    </li><li>Fixes an issue where an apostrophe would get added to the end of email addresses suggested as reviewers in feedback requests</li>\n    <li>Fixes an issue with the display of images in comments on a GitLab merge request</li>\n    <li>Fixes an issue preventing you from being able to paste when editing most content types on CodeStream</li>\n    <li>Fixes an issue where editing an MR comment and adding a code fence results in divs being displayed</li>\n    <li>Fixes an issue where the code block doesn't immediately show in the merge request timeline after adding a new comment</li>\n    <li>Fixes an issue where you couldn't edit a merge request comment from Diff Hunks view</li>\n    <li>Fixes an issue with the responsiveness of the display of the Merge and Pipeline boxes in a merge request</li>\n    <li>Fixes an issue with the Changed Files in a pull request not loading in IntelliJ</li>\n    <li>Fixes an \"Illegal character in path\" error in PyCharm</li>\n</ul>\n<h4>11.0.4</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds the ability to toggle the display of pull request descriptions in the Pull Requests section</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>Establish GitLab v12.10 as the minimum required version for merge-request support</li>\n    <li>Update the color of the sidebar in GitLab merge request to match the heading of the CodeStream pane</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/502\">#502</a> - Can't checkout to the branch in a merge request\n    </li><li>Fixes an issue where clicking on Diff Hunks view in a pull request would result in an error</li>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/454\">#454</a> - Default headshot display to initials when gravatar/headshot can't be loaded for on-prem users\n    </li><li>Fixes an error when creating a codemark</li>\n    <li>Fixes an issue where trying to view a pull request via list/tree view results in an error</li>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/498\">#498</a> - GitLab MR doesn't show commits created after MR is added\n    </li><li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/429\">#429</a> - Incorrect user/repo listed at bottom of a PR\n    </li><li>Fixes an issue where the keyboard shortcut to add comment in a pull requeset often selects wrong line</li>\n    <li>Fixes an issue where hitting Esc to close the comment form in a pull request exits you out of the pull request completely</li>\n    <li>Fixes an issue where some loading/saving messages in pull requests don't go away after completion</li>\n    <li>Fixes an issue where merge requests created with unpushed branches lead to GraphQL error</li>\n    <li>Fixes an issue with the display of images in merge request descriptions</li>\n    <li>Fixes an issue replying to an existing comment in a merge request while there is a pending review</li>\n    <li>Fixes an issue deleting a pending review comment in a merge request</li>\n    <li>Fixes an issue with broken headshot display when adding a comment in a merge request</li>\n    <li>Fixes an issue where the \"requested a review\" banner in a pull request doesn't go away on submission of a review</li>\n    <li>Fixes an issue where WSL users can't select repo when creating a feedback reqest</li>\n</ul>\n<h4>11.0.3</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds the ability to edit a pending review comment in a GitLab merge request</li>\n    <li>Adds a roadblock to indicate that merge request support for GitLab Self Managed requires version 12.10.X or later</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>Ask user if they want to switch teams when clicking on a permalink for an item owned by a team other than the one you currently have selected</li>\n    <li>More efficient use of GitHub api points to prevent users from getting hit with rate-limit errors</li>\n    <li>Decrease the number of git operations being performed at extension startup</li>\n    <li>When going a quote reply in a pull/merge request, a blank line is automatically inserted before the cursor to prevent entered text from being included in the quote</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/514\">#514</a> - Merge request not listed when using proxy\n    </li><li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/477\">#477</a> - Add messaging when not all files in a large MR will be listed\n    </li><li>Fixes an issue where the issue you select via Start Work in one team, also appears in the Work In Progress section for all of your teams</li>\n    <li>Fixes an error when creating a pull request</li>\n    <li>Fixes an issue with the Open File buttons in the Changed Files section of a feedback request not working</li>\n    <li>Fixes an issue with creating a pull request on Bitbucket</li>\n    <li>Fixes an issue where collapsing/expanding sections in the Pull Requests section would cause all queries to refresh</li>\n    <li>Fixes an issue where clicking on a mention in a merge request opens a blank page</li>\n    <li>Fixes an issue where a local-changes warning would be shown when creating a pull request when there's weren't any local changes in the selected repository</li>\n    <li>Fixes an issue where clicking \"Add Comment\" from hover for icon in editor gutter results in the wrong code block being selected</li>\n</ul>\n<h4>11.0.2</h4>\n<h5>Fixed</h5>\n<ul>    \n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/486\">#486</a> - Unexpected error clicking on a merge request after update to 11.0\n</li></ul>\n<h4>11.0.1</h4>\n<h5>Changed</h5>\n<ul>\n    <li>List of PRs in the Pull Requests section automatically refreshes after reconnecting to a previously disconnected service</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/488\">#488</a> - Can't save custom MR query\n    </li><li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/486\">#486</a> - Unexpected error clicking on a merge request after update to 11.0\n    </li><li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/483\">#483</a> - Error loading git info when trying to ammend a feedback request\n    </li><li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/482\">#482</a> - Gitlab open merge request error field 'approvalsRequired'\n    </li><li>Fixes field 'stages' doesn't exist on type 'Pipeline' on GitLab Self-Managed 13.2.3</li>\n    <li>Fixes field 'currentUser' doesn't exist on type 'Query' on GitLab Self-Managed 12.X and below</li>\n    <li>Fixes field 'approvalsLeft' doesn't exist on type 'MergeRequest'</li>\n    <li>Fixes field 'id' doesn't exist on type 'User' on GitLab Self-Managed 12.X and below</li>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/470\">#470</a> - Shouldn't be able to submit review with zero pending comments\n    </li><li>Fixes an issue with the Template dropdown incorrectly being displayed when creating a PR on GitHub</li>\n    <li>Fixes an issue with the display of the \"source branch is X commit behind the target branch\" copy in a merge request</li>\n    <li>Fixes an issue with line breaks getting lost in the description of a feedback request</li>\n    <li>Fixes an issue where you can't dismiss a feedback request when opening it via a toast notification on top of an open pull request\n    </li><li>Fixes an error clicking on the Files Changed tab of a pull request</li>\n</ul>\n<h4>11.0.0</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds support for <a href=\"http://www.codestream.com/blog/codestream-11-0-manage-gitlab-merge-requests-code-reviews-and-issues-in-vscode-jetbrains\">managing and reviewing GitLab merge requests</a></li>\n    <li>Adds blue unread-message badges in the Feedback Requests and Codemarks sections when there are new replies</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>Replaced the \"Reject\" button in feedback requests with \"Request Changes\"</li>\n    <li>Renamed the \"Needs Works\" section in Feedback Requests to \"Changes Requested\"</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes an issue that would cause blue badges to appear for codemarks/feedback requests even if they didn't have unread replies</li>\n    <li>Fixes an issue where Cmd + Enter submits a feedback request with no changes selected</li>\n    <li>Fixes an issue where you'd get prompted to review changes after changing branches</li>\n    <li>Fixes an issue where the Linear integration wasn't recognizing multiple teams</li>\n    <li>Fixes an issue where the assignees list wasn't complete when creating an issue on GitLab</li>\n    <li>Fixes an issue with an extraneous entry appearing in the branch dropdowns when creating a pull request</li>\n    <li>Fixes an issue with Shift+Click not working on Windows when trying to select a range of commits to review in a pull request</li>\n    <li>Fixes an issue with the Feedback menu item under the headshot menu not working</li>\n</ul>\n<h4>10.7.3</h4>\n<h5>Changed</h5>\n<ul>\n    <li>Toast notifications for commits are shown even if a feedback request already exists for the given commmit, as long as the feedback request is still open</li>\n    <li>The heading of the Codemarks section now shows the number of open codemarks when the section is collapsed</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes an unexpected error when clicking on the Files Changed tab in a pull request</li>\n</ul>\n<h4>10.7.2</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds the ability to set up the Jira Server (v8.14.0 or later) integration using an API token</li>\n    <li>Ability to create a pull request against a fork on GitHub Enterprise</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>Local changes now only block creation of a pull request when done in the context of a feedback request, otherwise it's just a warning</li>\n    <li>When creating a pull request, if the diff is huge it is now not displayed by default</li>\n    <li>Minor change to the navigation in the sign up/in flow when authenticating via a 3rd party</li>\n    <li>UX improvement to the Notification Settings page</li>\n    <li>When a teammate proactively creates a feedback request to review a commit of yours, you are now shown as the code author for that feedback request and it will appear in the \"Open\" section of the Feedback Requests section</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/348\">#348</a> - Fixes an issue with checking out to a pull request's branch when the repo name included upper case letters</li>\n</ul>\n<h4>10.7.0</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds toast notifications prompting you to review new commits from a teammate after you do a pull</li>\n    <li>Adds the ability to review changes in a pull request since your last review, or for a specific range of commits</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>When you resovle a codemark the modal is now automatically closed</li>\n    <li>When creating a feedback request from an auto-prompt, the first line of the commit message is used as the FR title and anything after a newline character goes into the description</li>\n    <li>Moved repository/branch information into the header of feedback requests</li>\n    <li>Improved support for SSH aliases to prevent \"The git repository for this review is not currently open in the IDE\" messages from incorrecly being displayed</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes an issue with the you-don't-have-this-file warning, when you view a codemark in a file that doesn't exist in your branch, not persisting</li>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/406\">#406</a> - Inject as comment inserts at wrong marker</li>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/338\">#338</a> - multiline code break (newline) markdown not rendering inside code block syntax</li>\n    <li>Fixes an issue with attaching files via copy-and-paste</li>\n    <li>Fixes an issue with codemarks created on Windows showing a diff for the codeblock when there wasn't one</li>\n    <li>Fixes an issue where pull_request_template.md files in uppercase weren't being recognized when creating a PR</li>\n    <li>Fixes an issue with the inline display of images with a ? in the file name</li>\n    <li>Fixes an issue where you couldn't cancel out of the Onboarding Settings modal</li>\n</ul>\n<h4>10.6.1</h4>\n<h5>Added</h5>\n<ul>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/411\">#411</a> - Case sensitive branch names</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>\"+\" button to comment on code is only shown in the editor gutter on selection (i.e., not on hover) unless you're in a diff for a feedback request or pull request</li>\n    <li>Even if Line Number is the selected sort, the sorting of the Codemarks section is always Date unless Current File is the selected filter</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes an issue with connecting on on-prem services, such as GitHub Entperise and Bitbucket Server</li>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/408\">#408</a> - Codemark not showing code block with Russian characters</li>\n    <li>Fixes an issue when clicking on icons in the editor gutter for pull request comments from Bitbucket or GitLab</li>\n    <li>Fixes an issue with viewing diffs for pull requests from forks</li>\n    <li>Fixes an issue where manually entering triple backticks when adding a code block to a post breaks the formatting of the post</li>\n    <li>Fixes an issue where the contents of the Codemarks section would unecessarily reload when switching files within the same repo</li>\n    <li>Fixes an issue when clicking to see git diff in review window would trigger an undefined error</li>\n</ul>\n<h4>10.6.0</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds the ability to review a pull request by a specific commit</li>\n    <li>Adds a new onboarding tour focussed on educating new users on CodeStream's key features</li>\n    <li>Adds a \"Shared To\" section to codemarks and feedback requests indicating when the item was shared to Slack</li>\n    <li>Adds an <a href=\"https://www.codestream.com/blog/codestream-10-6-discussion-resolutions-published-to-slack\">automated post to Slack</a> when a shared codemark or feedback request has been resolved</li>\n    <li>Adds the feedback request title to the toast notification when the request is approved, rejected ot reopened</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes an issue with “disable strict SSL” setting not working for self-hosted services</li>\n    <li>Fixes an issue with an HTTPS-Required popup incorrectly showing for new on-prem installations</li>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/388\">#388</a> - Codemark issue with filenames containing \"+\" char</li>\n    <li>Fixes an unexpected error when clicking on a pull request</li>\n    <li>Fixes an issue with the count in the heading of the Coedmarks section being incorrect when filter isn't set to the current file</li>\n    <li>Fixes an issue commenting in a pull request in a file in a folder that doesn't exist in your current branch</li>\n    <li>Fixes an issue with the Slack integration not appearing as a green tile on the Integrations page immediately after connecting</li>\n    <li>Fixes an issue with the Locate button not working in a feedback request when you don't have the given repo open</li>\n    <li>Fixes an issue with commenting on code in files that are symlinks</li>\n    <li>Fixes an issue with icons for PR comments not appearing in the editor gutter when the file is a type not supported by the IDE</li>\n</ul>\n<h4>10.5.1</h4>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes an issue that caused an 'Unexpected Error' screen on sign-in</li>\n</ul>\n<h4>10.5.0</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds PSI (code intelligence) to diffs for both feedback requests and pull requests</li>\n    <li>Adds a prompt to create a feedback request when you commit code from outside the IDE, which can be turned off via a toggle above the form</li>\n    <li>Adds checkbox to the Notifications page to control the new Feedback Request Reminder email notification</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>Comment codemarks can now be resolved</li>\n    <li>The Codemarks section of the sidebar breaks out codemarks by status (open, resolved, archived) with new colors for each</li>\n    <li>Default filters on the Search page are now Open Issues, Open Code Comments, and Open Feedback Requests, and is:open / is:closed advanced syntax now includes comment codemarks</li>\n    <li>CodeStream on-prem customers can now connect to Jira's cloud service using API tokens instead of OAuth</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes issue that prevented pull request creation on github.io repositories</li>\n    <li>Fixes an issue with invitation codes for on-prem customers not correctly setting the CodeStream server URL for the invitee</li>\n    <li>Fixes an issue when commenting on a pull request that has been sitting open for more than an hour</li>\n    <li>Fixes a formatting issue with issues created on Asana</li>\n</ul>\n<h4>10.4.3</h4>\n<h5>Fixed</h5>\n<ul>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/392\">#392</a> - Codemark not showing code block when created from Windows</li>\n</ul>\n<h4>10.4.2</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds a new tree view in the Changed Files section of feedback requests</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>Stop sending toast notifications for closed pull requests</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes an issue where CodeStream could trigger the IntelliJ decompiler</li>\n    <li>Fixes an issue with commenting in a feedback request in a file with an @ in the name</li>\n    <li>Fixes an issue preventing you from being able to edit a feedback request</li>\n    <li>Fixes an issue creating an issue codemark on GitLab cloud</li>\n</ul>\n<h4>10.4.1</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds the ability to attach files to a feedback request, or to a reply</li>\n    <li>Adds support for custom queries for Jira Server in the Issues section</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>Automatically populate all reviewer slots in a feedback request, going to recent committers if necessary, if one of the \"authorship\" assignment options is selected</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/380\">#380</a> - Viewing a PR with status checks on GitHub Enterprise generates an error</li>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/376\">#376</a> - Can't exit preview mode when creating a feedback request</li>\n    <li>Fixes an issue where you'd end up in an infinite \"Fetching repo...\" loop trying to create an issue on Bitbucket</li>\n    <li>Fixes an issue creating a permalink when in a WSL environment</li>\n</ul>\n<h4>10.4.0</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds support for <a href=\"https://www.codestream.com/blog/codestream-10-4-file-attachments-github-status-checks\"></a>file attachments when creating comment or issue codemarks</li>\n    <li>Adds support for GitHub status checks in pull requests rendered in CodeStream</li>\n    <li>When selecting a Linear issue to start work, the branch name associated with the issue is used</li>\n    <li>Adds the ability to pull the latest, if the base branch is behind origin, when previewing diffs while creating a pull request</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>Prevent the creation of codemarks when in a preview diff while submitting a feedback request</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/353\">#353</a> - Codemark glyphs do not show up in WSL environment</li>\n    <li>Fixes an issue where starting work on an issue creates a feature branch against the wrong base</li>\n    <li>Fixes a data integrity issue that led to a small group of users getting an error clicking on a codemark</li>\n    <li>Fixes with the fetching of too much history data from PubNub if client clock is inaccurately set</li>\n    <li>Performance improvements</li>\n    <li>Fixes an issue with feedback requests assigned to you not appearing in the Approved or Needs Work sections without a reload</li>\n</ul>\n<h4>10.3.0</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds a new integration with the Linear issue-tracking service</li>\n    <li>Adds an <a href=\"https://medium.com/teamcodestream/how-we-extended-gitlens-pull-request-functionality-in-visual-studio-code-f4dbecbea4c2\"></a>integration with GitLens which allows you to create and view pull requests using CodeStream</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/364\">#364</a> - Copy button in PR is copying the base branch name instead of the compare branch</li>\n    <li>Fixes an issue where the Open File button in the Tree View of the list of files in a PR wouldn't open the correct file if sections of the tree were collapsed</li>\n</ul>\n<h4>10.2.2</h4>\n<h5>Added</h5>\n<ul>\n    <li>Split the Feedback Requests section of the sidebar into sections for Open, Approved and Needs Work</li>\n    <li>When selecting a ticket to start work, added an option to pull latest if base branch is behind origin</li>\n    <li>Added the ability to set a default base branch per repo when creating a feature branch</li>\n</ul>\n<h4>10.2.1</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds a new onboarding flow for some users that guides them through the setup of integrations and creating their first code comment</li>\n    <li>Adds the ability to generate a feedback request after commiting via the JetBrains commit dialog</li>\n    <li>Adds support for remotes using SSH aliases</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>When creating a feedback request only commits from current user are checked by default, and only if they include the most recent commit</li>\n    <li>The list in the Pull Requests section automatically updates when you open, close or merge a pull request from CodeStream</li>\n    <li>The hovers for icons in the editor gutter now make it clear if the discussion was a comment, issue, feedback request or pull request</li>\n    <li>Optimization of git operations to gather commits when creating a feedback request</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes an issue where CodeStream would repeatedly reload</li>\n    <li>Fixes an issue that would create an error when clicking on a feedback request due to bad data</li>\n</ul>\n<h4>10.2.0</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds new onboarding settings for team admins that allow people to join teams based on repository access, and allow admins to restrict integration and authentication options</li>\n    <li>Adds a warning if you have local changes when trying to create a pull request</li>\n    <li>Adds new gear menu to header of the My Team section to access team settings and administration</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes an issue where icons, reprsenting comments, wouldn't be displayed in the gutter of pull request diffs</li>\n    <li>Fixes an issue where some users would run into GitHub rate limiting issues when working with pull requests</li>\n    <li>Fixes an issue where the markdown preview for commenting in a pull request was always empty</li>\n    <li>Fixes an issue where adding multiple code blocks to a codemark would result in some not getting added</li>\n    <li>Fixes an issue where a GitHub disconnect banner would incorrectly appear due to lack of internet connectivity</li>\n    <li>Fixes an issue where some users would get stuck on the Loading page trying to get into CodeStream</li>\n</ul>\n<h4>10.1.2</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds the \"Outdated\" label to comments on outdated code displayed in a pull request</li>\n    <li>Improved diff creation for feedback requests so that you should rarley see the “a commit required to perform this review was not found in the local repository” message</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>Adds more meta data to hovers for icons in the editor gutter</li>\n    <li>Removed non-contextual items from the CodeStream context menu</li>\n    <li>Setting to not display the + button when hovering in the gutter now takes effect without needing to restart the IDE</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes an issue where multiple lines of code displayed in a code fence were collapsed down to a single line</li>\n    <li>Fixes an issue where Start Work would break if selected a CodeStream issue and the branch template used only {id}</li>\n    <li>Fixes an issue where a feedback request couldn't be submitted against a brand new repo with a single commit</li>\n    <li>Fixes an issue with the \"show instructions\" link at the bottom of a feedback request that has replies</li>\n    <li>Fixes an off-by-1 issue in the display of comments on the Conversation tab in pull requests</li>\n</ul>\n<h4>10.1.1</h4>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes an issue that prevented you from starting a review when commenting in a pull request</li>\n</ul>\n<h4>10.1.0</h4>\n<h5>Added</h5>\n<ul>\n    <li>Add an integration with Clubhouse that allows you to create stories and see your backlog</li>\n    <li>Adds the ability to create a GitHub pull request across forks</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>Improves the UX on the form to submit a review in a pull request by making it clear that the Cancel button is for cancelling the review, and not dismissing the form</li>\n    <li>Clarifies that when commenting on code outside of the changeset in a pull request, while a review is pending, the comment is added at the PR level and not included in the review</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/191\">#191</a> - Codestream interferes with rebasing in Jetbrains</li>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/296\">#296</a> - \"Error 401: Unauthorized\" when opening a PR on GitLab Self Managed</li>\n    <li>Fixes an issue where the icons for pull request comments would be displayed on the wrong line in the gutter of the diff</li>\n    <li>Fixes an issue that would result in an error trying to view a pull request</li>\n    <li>Fixes an issue where the viewed status of files in the pull request would get reset after adding a comment</li>\n    <li>Fixes an issue that prevented the creation of single pull request comments with certain GitHub Enterprise instances</li>\n    <li>Fixes an issue where files would not be displayed in tree view of a pull request if the folder name was a superset of another folder name</li>\n</ul>\n<h4>10.0.5</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds the ability to react to a comment, issue or feedback request, whereas you previously could only react to a reply</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>Changed the default branch name template to just use the issue's title</li>\n    <li>Clicking on an icon in the gutter of a pull-request diff now scrolls you to the corresponding comment</li>\n    <li>Improved logic for naming repositories to prioritize upstream and origin remotes</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes an issue that prevented pull request comments from being displayed immediately as icons in the diff gutter</li>\n    <li>Fixes an issue that would prevent you from viewing a pull request that had a team as a reviewer</li>\n    <li>Fixes an issue that would generate an error if you reloaded while configuring an on-prem issue tracking/code hosting service</li>\n</ul>\n<h4>10.0.4</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds a new extension setting to turn off the \"+\" compose button on hover in the gutter</li>\n    <li>Adds more space around the \"+\" compose button so that it doesn't interfer with setting a breakpoint</li>\n    <li>Automatically adds the codestream.xml file to your .gitignore</li>\n    <li>Adds the ability to mention GitHub collaborators when commenting on a pull request</li>\n    <li>Adds typeahead search when selecting branches for a new pull request</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>After creating a pull request, when you then close it you are brought to the CodeStream sidebar instead of back to the Open a Pull Request page</li>\n    <li>Provide more guidance for users trying to sign up/in with GitLab regarding the need to have a public primary email on GitLab</li>\n    <li>The \"Work in Progress\" section is now more performant, with reduced api requests</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/322\">#322</a> - When creating a pull request on GitLab or Bitbucket, CodeStream would try to open it in the IDE instead of on the appropriate service</li>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/315\">#315</a> - Creating a PR on GitLab Self-Managed switches base branch with compare branch</li>\n    <li>Fixes an issue trying to view a pull request in a repo with more than 100 open or merged pull requests</li>\n    <li>Fixes an issue where our polling for updates to a pull request would trigger an error when the user comes back from beign offline</li>\n    <li>Fixes an issue with Open Local File not working from the Files Changed tab in a pull request</li>\n    <li>Fixes an issue that would prevent you from creating a pull request if you had repos from both GitHub and GitHub Entperise open in your IDE</li>\n</ul>\n<h4>10.0.3</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds a new \"+\" in the editor gutter, when you either hover or select a code block, for adding comment codemarks</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>After creating a pull request on GitHub Enterprise you are now taken right into the newly created pull request on CodeStream</li>\n    <li>Toast notifications for when you're added as a reviewer or assignee to a pull request are now not limited to open pull requests</li>\n    <li>Better messaging when you try to create a pull request with no repositories open</li>\n    <li>Updated Slack app to use Slack's new granular permissions</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes an issue where clicking on a toast notification for a comment in a review would take you to the individual comment view, and not to the review</li>\n    <li>Fixes an issue where CodeStream would not properly initialize until the tool window is expanded</li>\n    <li>Fixes an issue where pull requests from older versions of GitHub Enterprise wouldn't load</li>\n    <li>Fixes an issue where the list of projects and the list of assignees where not list alphabetically when creating an issue on Azure DevOps</li>\n    <li>Fixes an issue where you'd receive a toast notification when assiging a pull request to yourself</li>\n    <li>Fixes an issue where the default notifications settings weren't being reflected on the Notifications page for new users</li>\n    <li>Fixes an issue where the editing of a range in a mult-range codemark caused a change in the ordering of the ranges</li>\n    <li>Fixes an issue with some modals having two \"X\"s to dismiss</li>\n    <li>Fixes an issue with ESC not properly dismissing modals/pages</li>\n    <li>Fixes an issue where certain actions would inappropriately land you in spatial view</li>\n</ul>\n<h4>10.0.2</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds the ability, in a codemark with multiple code blocks, to intersperse the blocks of code in the codemark text by refencing them with `[#1]`</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>Changed reference to \"requested a review\" in activity feed to \"requested feedback\"</li>\n    <li>Replaces \"upgrade\" link under headshot menu with sales@codestream.com for on-prem customers</li>\n    <li>Makes the CodeStream context menu options available while the IDE is in dumb mode</li>\n    <li>Improve performance and reduce memory usage by caching some expensive git operations</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Addresses <a href=\"https://github.com/TeamCodeStream/CodeStream/issues/301\">#301</a> - Creating Feedback Request fails</li>\n    <li>Fixes an issue where, after adding a code comment in a pull request, the icon in the diff gutter would not appear immediately</li>\n    <li>Fixes an issue where creating a pull request or feedback request from the WIP section didn't default to the correct repo</li>\n    <li>Fixes an issue with \"/dev/null\" entries appearing in list of files when creating a pull request</li>\n    <li>Fixes an issue with the CodeStream pane missing a tool window title</li>\n    <li>Fixes an issue with the CodeStream context menu missing an icon</li>\n</ul>\n<h4>10.0.1</h4>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes an issue where authentication with your code host would seem to fail if you didn't have a repo from that code host open in your IDE</li>\n</ul>\n<h4>10.0.0</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds the ability to submit a review in a pull request without having to first start a review via a code comment</li>\n    <li>Code Reviews have been renamed Feedback Requests to better reflect the fact that they are more informal, and are used more frequently, to get feedback on your work in progress throughout the development process</li>\n    <li>Adds the ability to jump to your local version of a file from any comment in a pull request</li>\n    <li>Adds two new ways to view changes in a pull request. Tree view, which is similar to the current List view, but organizes the files as they’d appear in a source tree. And Diff Hunks view, which is the same view you’re used to seeing on GitHub. List and Tree view provide full-file context, whereas Diff Hunks shows just the lines that changed.</li>\n    <li>In any of the three views, mark any file as not viewed if you want to indicate to yourself that you need to come back to it again</li>\n    <li>Adds a new Data Export tool, for team admins only, that dumps all code comments (including those done in a feedback request) in CSV format</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>All-new tree based UI persistently exposes everything you need access to, and everything you need to do</li>\n    <li>The interface for commenting on code has been improved so that you’re clear on what code block, if any, has been selected. It’s also easier to add additional ranges.</li>\n    <li>When there’s a diff between the code in a codemark and the version you have locally, the original version, the current version, and a diff are all included in the codemark. No need to open a separate diff.</li>\n    <li>The Pull Requests section of the sidebar now includes a “Recent” section that shows you your five most recently created PRs, regardless of their current state.</li>\n    <li>When reviewing a pull request and commenting on code that isn't part of the changeset, it's now clear that the comment will be added as a PR-level comment and not as part of the review (due to GitHub's limitations)</li>\n    <li>When in spatial view of codemarks, there are now clearer indicators of when there are other codemarks above or below the fold</li>\n    <li>Diff is now automatically closed when you close a pull request's view</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes an issue where the Work in Progress section would not update unless you first visited the Team tab</li>\n</ul>\n<h4>9.1.0</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds toast notifications for when you've been assigned a new pull request that opens the PR in your IDE</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>Implemented Google's diff-match-patch as a fallback for maintaining the location of all markers and pull-request comments</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes an issue with long delays in opening diffs in a code review</li>\n    <li>Fixes an issue where the status of viewed files in a PR would get reset if you cancelled the submission of a comment</li>\n    <li>Fixes an issue with codemarks being displayed at the top of a file rather than their correct location</li>\n    <li>Fixes an issue preventing users from creating pull request comments on the last line of a file</li>\n    <li>Fixes an issue that prevented you from closing a pull request from CodeStream</li>\n    <li>Fixes an issue where you couldn't open a pull request diff immediately after opening the repo</li>\n    <li>Fixes an issue where the \"Rebase &amp; merge\" button in a PR wouldn't work without a reload</li>\n</ul>\n<h4>9.0.4</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds support for native navigation of pull requests (i.e., F7, arrows)</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes an issue where you'd get an error about not having the repo open, when you actually did, when trying to comment on a pull request</li>\n    <li>Fixes an issue with the GitHub Enterprise configuration step being skipped when connecting from the Pull Requests section of the Tasks tab</li>\n    <li>Fixes an issue with the required/suggested version roadblock display</li>\n</ul>\n<h4>9.0.2</h4>\n<h5>Added</h5>\n<ul>\n    <li>Better error handling for the GitHub pull-request integration, particularly around OAuth issues</li>\n    <li>Adds support for Kerberos when creating pull requests from CodeStream</li>\n    <li>Pull requests now reflect require-reviewers status</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>Removed the 5-person team size limit for companies on CodeStream's Free plan</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes an issue where the icon would not appear in the editor gutter right away for a newly created codemark</li>\n    <li>Fixes an issue with opening a PR from a repo that you no longer have locally</li>\n    <li>Fixes an issue with the caching of GitHub access tokens</li>\n</ul>\n<h4>9.0.1</h4>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes an issue with the creation of pull requests</li>\n</ul>\n<h4>9.0.0</h4>\n<h5>Added</h5>\n<ul>\n    <li>Adds support for GitHub templates when creating a pull request</li>\n    <li>Adds the ability to create custom GitHub queries to control which pull requests are displayed on the Tasks tab</li>\n    <li>Adds the ability to quickly name a code review or pull request based on ticket name, branch name or commit message</li>\n</ul>\n<h5>Changed</h5>\n<ul>\n    <li>Display of pull requests on the Tasks tab is now broken into sections for Waiting on My Review, Assigned to Me, and Created by Me</li>\n    <li>By default, only pull requests associated with repos you have open in your IDE are display, but you also have the ability to show all pull requests</li>\n    <li>Allows for the selection of remote branches when creating a PR</li>\n    <li>On the Search tab you can now use multiple `tag` arguments to create an AND query</li>\n    <li>When the Current File tab is in list view, multi-range codemarks are now only listed once</li>\n    <li>When creating a codemark, we now remember the last state of the checkbox(es) for any non-member notifications</li>\n    <li>Move cloud authentication options to the top of the signup page</li>\n</ul>\n<h5>Fixed</h5>\n<ul>\n    <li>Fixes an issue where you couldn't paste strings containing single quotes</li>\n    <li>Fixes an issue with creating codemarks in cshtml files</li>\n    <li>Fixes an issue with creating codemarks in a file in a renamed folder on the file system with a new name that varies only by case</li>\n    <li>Fixes an issue where the position of codemarks could not be determined</li>\n</ul>","dependencies":["com.intellij.modules.platform","Git4Idea"],"optionalDependencies":["org.jetbrains.plugins.go"],"since":"203.6682","sourceCodeUrl":"https://github.com/TeamCodeStream/codestream","size":77377537}