cask_args appdir: "/Applications"

# ----------------------------------------------------------------
# Prompt
# ----------------------------------------------------------------
# Cross-shell prompt for astronauts https://starship.rs
brew "starship"

# FIXME: it somehow fails on CI
unless ENV["CI"]
  # Developer targeted fonts with a high number of glyphs https://github.com/ryanoasis/nerd-fonts
  cask "font-hack-nerd-font"
end

# Fish shell like syntax highlighting for zsh https://github.com/zsh-users/zsh-syntax-highlighting
brew "zsh-syntax-highlighting"

# ----------------------------------------------------------------
# Shell Development Environments
# ----------------------------------------------------------------
# Autoformat shell script source code https://github.com/mvdan/sh
brew "shfmt"

# Static analysis and lint tool, for (ba)sh scripts https://www.shellcheck.net/
brew "shellcheck"

# Bash Automated Testing System https://github.com/bats-core/bats-core
brew "bats-core"

# ----------------------------------------------------------------
# Ruby
# ----------------------------------------------------------------
# Ruby version manager https://github.com/rbenv/rbenv#readme
brew "rbenv"

# Install various Ruby versions and implementations https://github.com/rbenv/ruby-build
brew "ruby-build"

# YAML Parser https://github.com/yaml/libyaml
brew "libyaml"

# ----------------------------------------------------------------
# Go
# ----------------------------------------------------------------
# Open source programming language to build simple/reliable/efficient software https://go.dev/
brew "go"

# Go Language's command-line interface for database migrations https://pressly.github.io/goose/
brew "goose"

# ----------------------------------------------------------------
# Brew
# ----------------------------------------------------------------
# Run your GitHub Actions locally https://github.com/nektos/act
brew "act"

# Cat(1) clone with syntax highlighting and Git integration. https://github.com/sharkdp/bat
brew "bat"

# Load/unload environment variables based on $PWD https://direnv.net/
brew "direnv"

# Modern replacement for ls. https://github.com/eza-community/eza
brew "eza"

# GitHub command-line tool. https://github.com/cli/cli
brew "gh"

# Distributed revision control system. https://git-scm.com
brew "git"

# GNU grep, egrep and fgrep https://www.gnu.org/software/grep/
brew "grep"

# Command-line benchmarking tool https://github.com/sharkdp/hyperfine
brew "hyperfine"

# Lightweight and flexible command-line JSON processor https://stedolan.github.io/jq/
brew "jq"

# Ambitious Vim-fork focused on extensibility and agility https://neovim.io/
brew "neovim"

# Object-relational database system https://www.postgresql.org/
brew "postgresql@14"

# Protocol buffers (Google's data interchange format) https://github.com/protocolbuffers/protobuf/
brew "protobuf"

# Persistent key-value database, with built-in net interface https://redis.io/
brew "redis"

# Search tool like grep and The Silver Searcher https://github.com/BurntSushi/ripgrep
brew "ripgrep"

# Intuitive find & replace CLI https://github.com/chmln/sd
brew "sd"

# Terminal multiplexer https://tmux.github.io/
brew "tmux"

# Dependencies app.sh | Select default apps for documents and URL schemes on macOS https://github.com/moretension/duti/
brew "duti"

# Simple command line interface for the Mac App Store. https://github.com/mas-cli/mas
brew "mas"

# A CLI for configuring 'Night Shift' on macOS https://github.com/smudge/nightlight
tap "smudge/smudge"
brew "smudge/smudge/nightlight"

# Dependency manager for Cocoa projects https://cocoapods.org/
brew "cocoapods"

# Play, record, convert, and stream audio and video https://ffmpeg.org/
brew "ffmpeg"

# Command-line tools for fly.io services https://fly.io
brew "flyctl"

# Command-line JSON processing tool https://github.com/antonmedv/fx
brew "fx"

# Like cURL, but for gRPC https://github.com/fullstorydev/grpcurl
brew "grpcurl"

# Build, test, and manage your Stripe integration https://stripe.com/docs/stripe-cli
tap "stripe/stripe-cli"
brew "stripe/stripe-cli/stripe"

# Official Amazon AWS command-line interface https://aws.amazon.com/cli/
brew "awscli"

# ----------------------------------------------------------------
# Cask
# ----------------------------------------------------------------
unless ENV["CI"]
  # Password manager that keeps all passwords secure behind one password. https://1password.com
  cask "1Password"

  # Command-line helper for the 1Password password manager https://developer.1password.com/docs/cli
  cask "1password-cli"

  # Web browser focusing on privacy https://brave.com/
  cask "brave-browser"

  # App to build and share containerized applications and microservices https://www.docker.com/products/docker-desktop
  cask "docker"

  # Voice and text chat software. https://discord.com
  cask "discord"

  # Collaborative interface design tool. https://www.figma.com
  cask "figma"

  # GIT client　https://fork.dev/
  cask "fork"

  # Web browser. https://www.google.com/chrome
  cask "google-chrome"

  # Google Cloud SDK https://cloud.google.com/sdk/
  cask "google-cloud-sdk"

  # Client for the Google Drive storage service https://www.google.com/drive/
  cask "google-drive"

  # Reverse proxy, secure introspectable tunnels to localhost https://ngrok.com/
  # cask "ngrok"

  # App to write, plan, collaborate, and get organized. https://www.notion.so
  cask "notion"

  # Collaboration platform for API development. https://www.postman.com
  cask "postman"

  # Control your tools with a few keystrokes https://raycast.app/
  cask "raycast"

  # Team communication and collaboration software. https://slack.com
  cask "slack"

  # Native GUI tool for relational databases https://tableplus.com/
  cask "tableplus"

  # Open-source code editor. https://code.visualstudio.com
  cask "visual-studio-code"

  # Rust-based terminal https://www.warp.dev/
  cask "warp"

  # Video communication and virtual meeting platform https://www.zoom.us/
  cask "zoom"

  # FreeMacSoft AppCleaner https://freemacsoft.net/appcleaner/
  cask "appcleaner"

  # Lock/unlock Apple computers using the proximity of a bluetooth low energy device https://github.com/ts1/BLEUnlock
  cask "bleunlock"

  # Screen Saver by Pedro Carrasco. https://github.com/pedrommcarrasco/Brooklyn
  cask "brooklyn"

  # Color picking application. https://colorsnapper.com
  cask "colorsnapper"

  # Tool for using an iPad as a second display https://www.duetdisplay.com/
  cask "duet"

  # Automated organization https://www.noodlesoft.com/
  cask "hazel"

  # Keyboard customizer. https://pqrs.org/osx/karabiner
  cask "karabiner-elements"

  # Automation software https://www.keyboardmaestro.com/main/
  cask "keyboard-maestro"

  # Web browser https://www.microsoft.com/edge
  cask "microsoft-edge"

  # Mozilla Firefox https://www.mozilla.org/firefox
  cask "firefox"

  # Mozilla Firefox Developer Edition. https://www.mozilla.org/firefox/developer
  cask "firefox-developer-edition"

  # HTTP and GraphQL Client https://insomnia.rest/
  cask "insomnia"

  # Wallet desktop application to maintain multiple cryptocurrencies https://www.ledgerwallet.com/live
  cask "ledger-live"

  # Music streaming service. https://www.spotify.com
  cask "spotify"

  # Virtual machines UI using QEMU https://getutm.app/
  cask "utm"

  # Tools for building Android applications https://developer.android.com/studio
  cask "android-studio"

  # Free and open-source 3D creation suite. https://www.blender.org
  cask "blender"

  # Virtual video-calling space https://gather.town/
  cask "gather"

  # Interface for reading and syncing eBooks. https://www.amazon.com/gp/digital/fiona/kcp-landing-page
  cask "kindle"

  # Online collaborative whiteboard platform https://miro.com/
  cask "miro"

  # VPN client focusing on security https://protonvpn.com/
  cask "protonvpn"

  # Messaging app with a focus on speed and security https://macos.telegram.org/
  cask "telegram"

  # Multimedia player. https://www.videolan.org/vlc
  cask "vlc"

  # Virtualization tool https://github.com/insidegui/VirtualBuddy
  cask "VirtualBuddy"

  # Graphical network analyzer and capture tool https://www.wireshark.org
  cask "wireshark"

  # ----------------------------------------------------------------
  # Mas
  # ----------------------------------------------------------------

  # Apple's integrated development environment for macOS. https://developer.apple.com/xcode/
  mas "Xcode", id: 497_799_835

  # New communication app which allows you to make FREE voice calls and send FREE messages https://apps.apple.com/app/line/id539883307
  mas "LINE", id: 539_883_307
end
